Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer.Attributes Property
 The attributes of the edge chamfer. For more information see EdgeChamfer.EdgeChamferAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EdgeChamfer.EdgeChamferAttributes Attributes { get; set; }
Public Property Attributes As EdgeChamfer.EdgeChamferAttributes
	Get
	Set
Property Value
Type: EdgeChamfer.EdgeChamferAttributes
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Drawing Namespace